{"recipes":[{"title":"French Lentils With Garlic and Thyme","imageUrl":"https://www.themealdb.com/images/media/meals/vwwspt1487394060.jpg","source":"https://www.youtube.com/watch?v=CrlTS1mJQMA","ingredients":"Olive Oil: 3 tablespoons\nOnion: 1\nGarlic: 2 cloves\nCarrot: 1\nFrench Lentils: 2 1/4 cups\nThyme: 1 teaspoon\nBay Leaf: 3\nSalt: 1 tablespoon\nCelery: 2 sticks","directions":"Place a large saucepan over medium heat and add oil. When hot, add chopped vegetables and sauté until softened, 5 to 10 minutes.\nAdd 6 cups water, lentils, thyme, bay leaves and salt. Bring to a boil, then reduce to a fast simmer.\nSimmer lentils until they are tender and have absorbed most of the water, 20 to 25 minutes. If necessary, drain any excess water after lentils have cooked. Serve immediately, or allow them to cool and reheat later.\nFor a fuller taste, use some chicken stock and reduce the water by the same amount.","id":"e4071e1b-947e-4f0f-98eb-b5edefe3cc42","slug":"french-lentils-with-garlic-and-thyme"},{"title":"Szechuan Beef","imageUrl":"https://www.themealdb.com/images/media/meals/1529443236.jpg","source":"https://www.youtube.com/watch?v=SQGZqZYz7Ms","ingredients":"Beef: 1/2 lb\nSalt: 1/2 tsp\nSesame Seed Oil: 1 tsp \nPepper: 1 pinch\nEgg White: 1\nStarch: 3 tbs\nOil: 4 tbs\nGinger: 1 tsp \nGarlic: 1 tsp \nOnion: 3/4 cup \nCarrots: 1/2 cup \nGreen Pepper: 3/4 cup \nCelery: 1 cup \nMushrooms: 1 cup \nCooking wine: 1 tbs\nWater: 1 cup \nOyster Sauce: 1 tbs\nHotsauce: 1/2 tsp\nSugar: 1 tsp \nSoy Sauce: 1 tbs","directions":"STEP 1 - MARINATING THE BEEF\nIn a bowl, add the beef, salt, sesame seed oil, white pepper, egg white, 2 Tablespoon of corn starch and 1 Tablespoon of oil.\nSTEP 2 - STIR FRY\nFirst Cook the beef by adding 2 Tablespoon of oil until the beef is golden brown.\nSet the beef aside\nIn a wok add 1 Tablespoon of oil, minced ginger, minced garlic and stir-fry for few seconds.\nNext add all of the vegetables and then add sherry cooking wine and 1 cup of water.\nTo make the sauce add oyster sauce, hot pepper sauce, and sugar.\nadd the cooked beef and 1 spoon of soy sauce\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.","id":"df5000fa-91e6-4aca-8107-0f3d5dd11066","slug":"szechuan-beef"},{"title":"Beef and Oyster pie","imageUrl":"https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg","source":"https://www.youtube.com/watch?v=ONX74yP6JnI","ingredients":"Beef: 900g\nOlive Oil: 3 tbs\nShallots: 3\nGarlic: 2 cloves minced\nBacon: 125g\nThyme: 1 tbs chopped\nBay Leaf: 2\nStout: 330ml\nBeef Stock: 400ml\nCorn Flour: 2 tbs\nOysters: 8\nPlain Flour: 400g\nSalt: pinch\nButter: 250g\nEggs: To Glaze","directions":"Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.\nIn the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.\nPreheat the oven to 180C/350F/Gas 4.\nPour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.\nSkim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.\nIncrease the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.\nRoll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.\nRoll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling.","id":"2c629e77-19f1-4e00-bc6b-f1ec25a42466","slug":"beef-and-oyster-pie"},{"title":"Apple & Blackberry Crumble","imageUrl":"https://www.themealdb.com/images/media/meals/xvsurr1511719182.jpg","source":"https://www.youtube.com/watch?v=4vhcOwVBDO4","ingredients":"Plain Flour: 120g\nCaster Sugar: 60g\nButter: 60g\nBraeburn Apples: 300g\nButter: 30g\nDemerara Sugar: 30g\nBlackberrys: 120g\nCinnamon: ¼ teaspoon\nIce Cream: to serve","directions":"Heat oven to 190C/170C fan/gas 5. Tip the flour and sugar into a large bowl. Add the butter, then rub into the flour using your fingertips to make a light breadcrumb texture. Do not overwork it or the crumble will become heavy. Sprinkle the mixture evenly over a baking sheet and bake for 15 mins or until lightly coloured.\nMeanwhile, for the compote, peel, core and cut the apples into 2cm dice. Put the butter and sugar in a medium saucepan and melt together over a medium heat. Cook for 3 mins until the mixture turns to a light caramel. Stir in the apples and cook for 3 mins. Add the blackberries and cinnamon, and cook for 3 mins more. Cover, remove from the heat, then leave for 2-3 mins to continue cooking in the warmth of the pan.\nTo serve, spoon the warm fruit into an ovenproof gratin dish, top with the crumble mix, then reheat in the oven for 5-10 mins. Serve with vanilla ice cream.","id":"071391ca-e2bf-4017-a5a8-fe308bc2103b","slug":"apple-blackberry-crumble"},{"title":"Chinon Apple Tarts","imageUrl":"https://www.themealdb.com/images/media/meals/qtqwwu1511792650.jpg","source":"https://www.youtube.com/watch?v=5dAW9HQgtCk","ingredients":"Puff Pastry: 320g\nDark Brown Soft Sugar: 4 tbs\nBraeburn Apples: 3\nRed Wine Jelly: 4 tbs\nCreme Fraiche: 100ml\nIcing Sugar: 1 tbs\nCardamom: 3","directions":"To make the red wine jelly, put the red wine, jam sugar, star anise, clove, cinnamon stick, allspice, split vanilla pod and seeds in a medium saucepan. Stir together, then heat gently to dissolve the sugar. Turn up the heat and boil for 20 mins until reduced and syrupy. Strain into a small, sterilised jam jar and leave to cool completely. Will keep in the fridge for up to 1 month.\n\nTake the pastry out of the fridge and leave at room temperature for 10 mins, then unroll. Heat the grill to high and heat the oven to 180C/160C fan/gas 4. Cut out 2 x 13cm circles of pastry, using a plate as a guide, and place on a non-stick baking sheet. Sprinkle each circle with 1 tbsp sugar and grill for 5 mins to caramelise, watching carefully so that the sugar doesn’t burn. Remove from the grill. Can be done a few hours ahead, and left, covered, out of the fridge.\n\nPeel, quarter and core the apples, cut into 2mm-thin slices and arrange on top of the pastry. Sprinkle over the remaining sugar and pop in the oven for 20-25 mins until the pastry is cooked through and golden, and the apples are softened. Remove and allow to cool slightly. Warm 3 tbsp of the red wine jelly in a small pan over a low heat with 1 tsp water to make it a little more runny, then brush over the top of the tarts.\n\nTip the crème fraîche into a bowl, sift over the icing sugar and cardamom, and mix together. Carefully lift the warm tarts onto serving plates and serve with the cardamom crème fraîche.","id":"8c2eef41-81c7-4107-8b09-94ca417d581b","slug":"chinon-apple-tarts"},{"title":"Beef and Mustard Pie","imageUrl":"https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg","source":"https://www.youtube.com/watch?v=nMyBC9staMU","ingredients":"Beef: 1kg\nPlain Flour: 2 tbs\nRapeseed Oil: 2 tbs\nRed Wine: 200ml\nBeef Stock: 400ml\nOnion: 1 finely sliced\nCarrots: 2 chopped\nThyme: 3 sprigs\nMustard: 2 tbs\nEgg Yolks: 2 free-range\nPuff Pastry: 400g\nGreen Beans: 300g\nButter: 25g\nSalt: pinch\nPepper: pinch","directions":"Preheat the oven to 150C/300F/Gas 2.\nToss the beef and flour together in a bowl with some salt and black pepper.\nHeat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.\nFry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.\nReturn the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.\nCover with a lid and place in the oven for two hours.\nRemove from the oven, check the seasoning and set aside to cool. Remove the thyme.\nWhen the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.\nTransfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.\nTrim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.\nFor the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.\nDrain and toss with the butter, then season with black pepper.\nTo serve, place a large spoonful of pie onto each plate with some green beans alongside.","id":"49a97c35-fb45-4e7e-babc-2d94c151b0cc","slug":"beef-and-mustard-pie"},{"title":"Carrot Cake","imageUrl":"https://www.themealdb.com/images/media/meals/vrspxv1511722107.jpg","source":"https://www.youtube.com/watch?v=asjZ7iTrGKA","ingredients":"Vegetable Oil: 450ml\nPlain Flour: 400g\nBicarbonate Of Soda: 2 tsp\nSugar: 550ml\nEggs: 5\nSalt: ½ tsp\nCinnamon: 2 tsp\nCarrots: 500g grated\nWalnuts: 150g\nCream Cheese: 200g\nCaster Sugar: 150g\nButter: 100g ","directions":"For the carrot cake, preheat the oven to 160C/325F/Gas 3. Grease and line a 26cm/10in springform cake tin.\nMix all of the ingredients for the carrot cake, except the carrots and walnuts, together in a bowl until well combined. Stir in the carrots and walnuts.\nSpoon the mixture into the cake tin and bake for 1 hour 15 minutes, or until a skewer inserted into the middle comes out clean. Remove the cake from the oven and set aside to cool for 10 minutes, then carefully remove the cake from the tin and set aside to cool completely on a cooling rack.\nMeanwhile, for the icing, beat the cream cheese, caster sugar and butter together in a bowl until fluffy. Spread the icing over the top of the cake with a palette knife.","id":"5a92579d-0cf3-4a60-a0a1-34d0207bcd5e","slug":"carrot-cake"},{"title":"Japanese gohan rice","imageUrl":"https://www.themealdb.com/images/media/meals/kw92t41604181871.jpg","source":"https://www.youtube.com/watch?v=rZO86_-MIp0","ingredients":"Sushi Rice: 300g\nMirin: 1 tbs\nPickle Juice: Garnish\nSpring Onions: Garnish","directions":"STEP 1\nRinsing and soaking your rice is key to achieving the perfect texture. Measure the rice into a bowl, cover with cold water, then use your fingers to massage the grains of rice – the water will become cloudy. Drain and rinse again with fresh water. Repeat five more times until the water stays clear.\n\nSTEP 2\nTip the rinsed rice into a saucepan with 400ml water, or 200ml dashi and 200ml water, bring to the boil, then turn down the heat to a low simmer, cover with a tight-fitting lid with a steam hole and cook for 15 mins. Remove from the heat and leave to sit for another 15 mins, then stir through the mirin. Remove the lid and give it a good stir. Serve with any or all of the optional toppings.","id":"3cc49a4b-c7cd-43d3-8c39-3d2cdaaa42c7","slug":"japanese-gohan-rice"},{"title":"kurczak","imageUrl":"","source":"","ingredients":"","directions":"","id":"193a56a5-de2d-4215-81d8-302fa1e6ccc2","slug":"kurczak"},{"title":"naleśniki gryczane z boczniakami i porem","imageUrl":"","source":"http://strawberriesfrompoland.pl/2015/01/17/a-w-styczniu-lubie-nalesniki-gryczane-z-2/","ingredients":"na ciasto naleśnikowe:\n3/4 szklanki mąki gryczanej\n1/2 łyżeczki soli\nok. 2 szklanki wody (połowę porcji wody daję w wersji gazowanej)\n1 jajko\n2 łyżki oleju rzepakowego\nolej rzepakowy do smażenia\nna farsz:\n1 por\nok. 200 g boczniaków\n1 ząbek czosnku (opcjonalnie)\nsól i pieprz do smaku\n2 łyżki oleju rzepakowego","directions":"W misce ubijam jajko, dodaję resztę składników i mieszam trzepaczką (nie mikserem). Odstawiam na 5-10 minut. Po tym czasie smażę na rozgrzanej patelni po ok. 2 minuty z każdej strony (na niewielkiej ilości tłuszczu). Gotowe naleśniki odkładam na duży talerz, przykrywam folią aluminiową, by nie stygły.\nPrzygotowuję farsz: umytego pora kroję w paseczki (ciemnozieloną część odkładam), podobnie postępuję z grzybami. Na patelni rozgrzewam 1 łyżkę oleju i dodaję boczniaki. Solę je i smażę, dopóki nie stracą objętości. Następnie przekładam je na talerz. Na patelni rozgrzewam drugą łyżkę oleju i dodaję pora z czosnkiem. Smażę na niewielkim ogniu, aż por stanie się miękki. Dodaję doń grzyby, smażę jeszcze chwilę. Doprawiam pieprzem i ewent. solą.\nNadzienie umieszczam na 1/2 części naleśnika, którego składam wedle upodobania (koperta, chusteczka, pakiecik). Jeśli mam ochotę, podsmażam jeszcze naleśnika z nadzieniem.","id":"2ce478e9-fcd1-486a-a18b-c2db4df75c8d","slug":"naleniki-gryczane-z-boczniakami-i-porem"},{"title":"Vietnamese Grilled Pork (bun-thit-nuong)","imageUrl":"https://www.themealdb.com/images/media/meals/qqwypw1504642429.jpg","source":"https://www.youtube.com/watch?v=Q3qcQcENzbU","ingredients":"Pork: 1.5 pounds sliced\nRice Vermicelli: 1 package thin\nEgg Rolls: 4-6\nChallots: 3 tablespoons minced\nGarlic: 1.5 tablespoons minced garlic\nSugar: ¼ cup\nFish Sauce: 1 tablespoon\nSoy sauce: ½ tablespoon thick\nPepper: ½ tablespoon\nOlive Oil: 3 tablespoons\nCucumber: Sliced\nMint: Leaves\nPeanuts: Crushed","directions":"Slice the uncooked pork thinly, about ⅛\". It helps to slightly freeze it (optional).\r\nMince garlic and shallots. Mix in a bowl with sugar, fish sauce, thick soy sauce, pepper, and oil until sugar dissolves.\r\nMarinate the meat for 1 hour, or overnight for better results.\r\nBake the pork at 375F for 10-15 minutes or until about 80% cooked. Finish cooking by broiling in the oven until a nice golden brown color develops, flipping the pieces midway.\r\nAssemble your bowl with veggies, noodles, and garnish. Many like to mix the whole bowl up and pour the fish sauce on top, but I like to make individual bites and sauce it slowly.","id":"994a1c25-e04b-4b66-a013-b82c73e79456","slug":"vietnamese-grilled-pork-bun-thit-nuong"},{"title":"Pear Tarte Tatin","imageUrl":"https://www.themealdb.com/images/media/meals/rxvxrr1511797671.jpg","source":"https://www.youtube.com/watch?v=8U1tKWKDeWA","ingredients":"Pears: 8\nCaster Sugar: 100g \nButter: 100g \nStar Anise: 2\nCardamom: 3 Pods\nCinnamon: 1 large\nBrandy: 2 tbs\nPuff Pastry: 500g","directions":"Core the pears, then peel as neatly as possible and halve. If you like, they can be prepared up to a day ahead and kept in the fridge, uncovered, so that they dry out.\r\nTip the sugar, butter, star anise, cardamom and cinnamon into an ovenproof frying pan, about 20cm wide, and place over a high heat until bubbling. Shake the pan and stir the buttery sauce until it separates and the sugar caramelises to a toffee colour.\r\nLay the pears in the pan, then cook in the sauce for 10-12 mins, tossing occasionally, until completely caramelised. Don’t worry about them burning – they won’t – but you want to caramelise them as much as possible. Splash in the brandy and let it flambé, then set the pears aside.\r\nHeat oven to 200C/fan 180C/gas 6. Roll the pastry out to the thickness of a £1 coin. Using a plate slightly larger than the top of the pan, cut out a circle, then press the edges of the circle of pastry to thin them out.\r\nWhen the pears have cooled slightly, arrange them in the pan, cut side up, in a floral shape, with the pears around the edge pointing inwards. Rest the cinnamon stick on the top in the centre, with the cardamom pods scattered around.\r\nDrape the pastry over the pears, then tuck the edges down the pan sides and under the fruit (see Gordon’s guide). Pierce the pastry a few times, then bake for 15 mins. If a lot of juice bubbles up the side of the pan, pour it off at this stage (see guide). Reduce oven to 180C/fan 160C/gas 4 and bake for 15 mins more until the pastry is golden. Leave the tart to stand for 10 mins, then invert it carefully onto a serving dish.","id":"b5b08e78-1d56-4bad-906d-9f8399b54c69","slug":"pear-tarte-tatin"},{"title":"Honey Teriyaki Salmon","imageUrl":"https://www.themealdb.com/images/media/meals/xxyupu1468262513.jpg","source":"https://www.youtube.com/watch?v=4MpYuaJsvRw","ingredients":"Salmon: 1 lb\nOlive oil: 1 tablespoon\nSoy Sauce: 2 tablespoons\nSake: 2 tablespoons\nSesame Seed: 4 tablespoons","directions":"Mix all the ingredients in the Honey Teriyaki Glaze together. Whisk to blend well. Combine the salmon and the Glaze together.\r\n\r\nHeat up a skillet on medium-low heat. Add the oil, Pan-fry the salmon on both sides until it’s completely cooked inside and the glaze thickens.\r\n\r\nGarnish with sesame and serve immediately.","id":"39e5528e-39db-48db-b15d-d5fa6121eb89","slug":"honey-teriyaki-salmon"},{"title":"General Tso's Chicken","imageUrl":"https://www.themealdb.com/images/media/meals/1529444113.jpg","source":"https://www.youtube.com/watch?v=wWGwz0iBmvU","ingredients":"Chicken Breast: 1 1/2 \nPlain Flour: 3/4 cup \nEgg: 1\nStarch: 2 tbs\nBaking Powder: 1 tbs\nSalt: 1 tsp \nOnion Salt: 1/2 tsp\nGarlic Powder: 1/4 tsp\nWater: 3/4 cup \nChicken Stock: 1/2 cup \nDuck Sauce: 1/4 cup\nSoy Sauce: 3 tbs\nHoney: 2 tbs\nRice Vinegar: 1 tbs\nSesame Seed Oil: 2 tbs\nGochujang: 1/2 tbs\nStarch: 2 tbs\nGarlic: 1 clove\nSpring Onions: 2 chopped\nGinger: 1 tsp ","directions":"DIRECTIONS:\r\nSTEP 1 - SAUCE\r\nIn a bowl, add 2 Cups of water, 2 Tablespoon soy sauce, 2 Tablespoon white vinegar, sherry cooking wine, 1/4 Teaspoon white pepper, minced ginger, minced garlic, hot pepper, ketchup, hoisin sauce, and sugar.\r\nMix together well and set aside.\r\nSTEP 2 - MARINATING THE CHICKEN\r\nIn a bowl, add the chicken, 1 pinch of salt, 1 pinch of white pepper, 2 egg whites, and 3 Tablespoon of corn starch\r\nSTEP 3 - DEEP FRY THE CHICKEN\r\nDeep fry the chicken at 350 degrees for 3-4 minutes or until it is golden brown and loosen up the chicken so that they don't stick together.\r\nSet the chicken aside.\r\nSTEP 4 - STIR FRY\r\nAdd the sauce to the wok and then the broccoli and wait until it is boiling.\r\nTo thicken the sauce, whisk together 2 Tablespoon of cornstarch and 4 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.\r\nNext add in the chicken and stir-fry for a minute and serve on a plate","id":"5c4e7b37-b1a7-4de1-98cd-fb11a2e7fdd9","slug":"general-tsos-chicken"},{"title":"Kung Pao Chicken","imageUrl":"https://www.themealdb.com/images/media/meals/1525872624.jpg","source":"https://www.youtube.com/watch?v=QqdcCHQlOe0","ingredients":"Sake: 2 tbs\nSoy Sauce: 2 tbs\nSesame Seed Oil: 2 tbs\nCorn Flour: 2 tbs\nWater: 2 tbs\nChicken: 500g\nChilli Powder: 1 tbs\nRice Vinegar: 1 tsp \nBrown Sugar: 1 tbs\nSpring Onions: 4 Chopped\nGarlic Clove: 6 cloves\nWater Chestnut: 220g\nPeanuts: 100g ","directions":"Combine the sake or rice wine, soy sauce, sesame oil and cornflour dissolved in water. Divide mixture in half.\r\nIn a glass dish or bowl, combine half of the sake mixture with the chicken pieces and toss to coat. Cover dish and place in refrigerator for about 30 minutes.\r\nIn a medium frying pan, combine remaining sake mixture, chillies, vinegar and sugar. Mix together and add spring onion, garlic, water chestnuts and peanuts. Heat sauce slowly over medium heat until aromatic.\r\nMeanwhile, remove chicken from marinade and sauté in a large frying pan until juices run clear. When sauce is aromatic, add sautéed chicken and let simmer together until sauce thickens.","id":"040bf929-6a2d-4ea0-970c-8688d28e9b8e","slug":"kung-pao-chicken"},{"title":"Chicken Enchilada Casserole1","imageUrl":"https://www.themealdb.com/images/media/meals/qtuwxu1468233098.jpg","source":"https://www.youtube.com/watch?v=EtVkwVKLc_M","ingredients":"Enchilada sauce: 14 oz jar\nshredded Monterey Jack cheese: 3 Cups\ncorn tortillas: 6\nchicken breasts: 2","directions":"Cut each chicken breast in about 3 pieces, so that it cooks faster and put it in a small pot. Pour Enchilada sauce over it and cook covered on low to medium heat until chicken is cooked through, about 20 minutes. No water is needed, the chicken will cook in the Enchilada sauce. Make sure you stir occasionally so that it doesn't stick to the bottom.\nRemove chicken from the pot and shred with two forks.\nPreheat oven to 375 F degrees.\nStart layering the casserole. Start with about ¼ cup of the leftover Enchilada sauce over the bottom of a baking dish. I used a longer baking dish, so that I can put 2 corn tortillas across. Place 2 tortillas on the bottom, top with ⅓ of the chicken and ⅓ of the remaining sauce. Sprinkle with ⅓ of the cheese and repeat starting with 2 more tortillas, then chicken, sauce, cheese. Repeat with last layer with the remaining ingredients, tortillas, chicken, sauce and cheese.\nBake for 20 to 30 minutes uncovered, until bubbly and cheese has melted and started to brown on top.\nServe warm.","id":"dc3eed36-1124-41f7-aac9-c2bbe5aec137","slug":"chicken-enchilada-casserole1"},{"title":"Fennel Dauphinoise1","imageUrl":"https://www.themealdb.com/images/media/meals/ytttsv1511798734.jpg","source":"https://www.youtube.com/watch?v=tXBzZm2kkh8","ingredients":"Potatoes: 225g\nFennel: 1 small\nGarlic: 1 clove finely chopped\nMilk: 75 ml \nDouble Cream: 100ml\nButter: For Greasing\nParmesan Cheese: to serve","directions":"Heat oven to 180C/160C fan/gas 4. Put potatoes, fennel, and garlic in a medium non-stick pan. Pour in milk and double cream, season well and simmer gently, covered, for 10 mins, stirring halfway through, until potatoes are just tender.\nDivide the mixture between 2 small (about 150ml) buttered ramekins and scatter with Parmesan. Bake for 40 mins until the potatoes are golden and tender when pierced with a knife. Snip the reserved fennel fronds over before serving.","id":"1f6f23cd-ae94-448a-b998-892c584134e9","slug":"fennel-dauphinoise1"}]}